; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 2950)
	(= (fuel plane1) 494)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at plane2 city0)
	(= (capacity plane2) 2887)
	(= (fuel plane2) 124)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 2)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 3)
	(at plane3 city4)
	(= (capacity plane3) 10414)
	(= (fuel plane3) 608)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 15)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 5)
	(at plane4 city5)
	(= (capacity plane4) 6343)
	(= (fuel plane4) 1410)
	(= (slow-burn plane4) 3)
	(= (fast-burn plane4) 6)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 8)
	(at person1 city1)
	(at person2 city0)
	(at person3 city0)
	(at person4 city4)
	(at person5 city6)
	(at person6 city2)
	(at person7 city5)
	(at person8 city3)
	(at person9 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 804)
	(= (distance city0 city2) 534)
	(= (distance city0 city3) 798)
	(= (distance city0 city4) 941)
	(= (distance city0 city5) 503)
	(= (distance city0 city6) 955)
	(= (distance city1 city0) 804)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 859)
	(= (distance city1 city3) 874)
	(= (distance city1 city4) 607)
	(= (distance city1 city5) 639)
	(= (distance city1 city6) 696)
	(= (distance city2 city0) 534)
	(= (distance city2 city1) 859)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 623)
	(= (distance city2 city4) 760)
	(= (distance city2 city5) 645)
	(= (distance city2 city6) 538)
	(= (distance city3 city0) 798)
	(= (distance city3 city1) 874)
	(= (distance city3 city2) 623)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 819)
	(= (distance city3 city5) 813)
	(= (distance city3 city6) 919)
	(= (distance city4 city0) 941)
	(= (distance city4 city1) 607)
	(= (distance city4 city2) 760)
	(= (distance city4 city3) 819)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 571)
	(= (distance city4 city6) 864)
	(= (distance city5 city0) 503)
	(= (distance city5 city1) 639)
	(= (distance city5 city2) 645)
	(= (distance city5 city3) 813)
	(= (distance city5 city4) 571)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 596)
	(= (distance city6 city0) 955)
	(= (distance city6 city1) 696)
	(= (distance city6 city2) 538)
	(= (distance city6 city3) 919)
	(= (distance city6 city4) 864)
	(= (distance city6 city5) 596)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane3 city3)
	(at person1 city6)
	(at person2 city4)
	(at person3 city6)
	(at person5 city4)
	(at person6 city3)
	(at person7 city3)
	(at person8 city6)
	(at person9 city6)
	))

(:metric minimize (+ (* 1 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane1 city0)
   changed: (fuel plane1) from 494 to 2950
   goals met: 0 of 9
2. (refuel plane3 city4)
   changed: (fuel plane3) from 608 to 10414
   goals met: 0 of 9
3. (board person2 plane1 city0)
   deleted: (at person2 city0)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 9
4. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 0 of 9
5. (fly plane3 city4 city5)
   deleted: (at plane3 city4)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 0 to 2284, (fuel plane3) from 10414 to 8130
   goals met: 0 of 9
6. (board person9 plane1 city0)
   deleted: (at person9 city0)
   added: (in person9 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 0 of 9
7. (fly plane1 city0 city6)
   deleted: (at plane1 city0)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 2284 to 3239, (fuel plane1) from 2950 to 1995
   goals met: 0 of 9
8. (fly plane3 city5 city3)
   deleted: (at plane3 city5)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 3239 to 6491, (fuel plane3) from 8130 to 4878
   goals met: 1 of 9
9. (debark person3 plane1 city6)
   deleted: (in person3 plane1)
   added: (at person3 city6)
   changed: (onboard plane1) from 3 to 2
   goals met: 2 of 9
10. (board person5 plane1 city6)
   deleted: (at person5 city6)
   added: (in person5 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 2 of 9
11. (debark person9 plane1 city6)
   deleted: (in person9 plane1)
   added: (at person9 city6)
   changed: (onboard plane1) from 3 to 2
   goals met: 3 of 9
12. (fly plane1 city6 city4)
   deleted: (at plane1 city6)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 6491 to 7355, (fuel plane1) from 1995 to 1131
   goals met: 3 of 9
13. (debark person5 plane1 city4)
   deleted: (in person5 plane1)
   added: (at person5 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 4 of 9
14. (debark person2 plane1 city4)
   deleted: (in person2 plane1)
   added: (at person2 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 5 of 9
15. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 7355 to 8174, (fuel plane1) from 1131 to 312
   goals met: 5 of 9
16. (board person7 plane4 city5)
   deleted: (at person7 city5)
   added: (in person7 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 5 of 9
17. (board person8 plane3 city3)
   deleted: (at person8 city3)
   added: (in person8 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 5 of 9
18. (refuel plane4 city5)
   changed: (fuel plane4) from 1410 to 6343
   goals met: 5 of 9
19. (zoom plane4 city5 city2)
   deleted: (at plane4 city5)
   added: (at plane4 city2)
   changed: (total-fuel-used) from 8174 to 12044, (fuel plane4) from 6343 to 2473
   goals met: 5 of 9
20. (board person6 plane4 city2)
   deleted: (at person6 city2)
   added: (in person6 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 5 of 9
21. (fly plane4 city2 city3)
   deleted: (at plane4 city2)
   added: (at plane4 city3)
   changed: (total-fuel-used) from 12044 to 13913, (fuel plane4) from 2473 to 604
   goals met: 5 of 9
22. (debark person6 plane4 city3)
   deleted: (in person6 plane4)
   added: (at person6 city3)
   changed: (onboard plane4) from 2 to 1
   goals met: 6 of 9
23. (debark person7 plane4 city3)
   deleted: (in person7 plane4)
   added: (at person7 city3)
   changed: (onboard plane4) from 1 to 0
   goals met: 7 of 9
24. (fly plane3 city3 city1)
   deleted: (at plane3 city3)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 13913 to 17409, (fuel plane3) from 4878 to 1382
   goals met: 6 of 9
25. (refuel plane3 city1)
   changed: (fuel plane3) from 1382 to 10414
   goals met: 6 of 9
26. (board person1 plane3 city1)
   deleted: (at person1 city1)
   added: (in person1 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 6 of 9
27. (fly plane3 city1 city6)
   deleted: (at plane3 city1)
   added: (at plane3 city6)
   changed: (total-fuel-used) from 17409 to 20193, (fuel plane3) from 10414 to 7630
   goals met: 6 of 9
28. (debark person1 plane3 city6)
   deleted: (in person1 plane3)
   added: (at person1 city6)
   changed: (onboard plane3) from 2 to 1
   goals met: 7 of 9
29. (debark person8 plane3 city6)
   deleted: (in person8 plane3)
   added: (at person8 city6)
   changed: (onboard plane3) from 1 to 0
   goals met: 8 of 9
30. (fly plane3 city6 city3)
   deleted: (at plane3 city6)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 20193 to 23869, (fuel plane3) from 7630 to 3954
   goals met: 9 of 9
